#ifndef _STAGE01_H_
#define _STAGE01_H_
//-----------------------------------------------------------------------------------------
//ヘッダファイル
//-----------------------------------------------------------------------------------------
#include <d3dx9.h>

//-----------------------------------------------------------------------------------------
//マクロ定義
//-----------------------------------------------------------------------------------------
#define STAGE01_WAVEMAX (5)                 //このステージの最大wave数
#define WAVE_HIERARCHY (20)                 //1Waveの最大階層数

//-----------------------------------------------------------------------------------------
//構造体宣言
//-----------------------------------------------------------------------------------------
typedef struct
{
	int nNumWave;                                                //Waveの番号(現在のWave番号)
	bool bNumWaveClear;                                          //Waveのクリアフラグ
	int nNumWaveZone;                                            //今のWaveの階層
	bool bNumWaveZoneClear;                                      //Waveの敵が設置された階層の一回切りの敵のセットのフラグ(最大20階層対応)
	bool bNumWaveZoneOnceEnemySet;           //階層においての一回切り敵のセットフラグ
	bool bNumWaveZoneRepeatEnemySet;         //階層においての重複敵のセットフラグ
	int nNumWaveZoneRepeatEnemySetTime;      //複数セットする敵全滅したらカウントダウン,0以下になると重複敵のセットをする
	bool bStopCameraMove;                                        //ステージのカメラワークを停止するフラグ(trueなら停止)
}STAGE01;

//-----------------------------------------------------------------------------------------
//プロトタイプ宣言
//-----------------------------------------------------------------------------------------
void InitStage01(void);                                                        //ポリゴン(頂点)の初期化
void UpdateStage01(void);                                                      //ポリゴンの更新
void UninitStage01(void);                                                      //ポリゴンの終了
STAGE01 *GetStage01(void);                                                     //ステージのパラメータ取得

//階層クリア確認関数
void SetClear(int nMaxEnemyNum,int nKillEnemyNum,int nWave);                //引数1:敵の最大番号,引数2次の階層に進むために倒す必要がある敵の数

#endif